# LooseCurtainWallData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LooseDimensionFailures..::..LooseCurtainWallData Property
BuiltInFailures..::..LooseDimensionFailures Class See Also
---
Switching element type to a non-Curtain element Family type. All data about Mullions, Grid Lines, and design units for the Curtain element will be lost.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LooseCurtainWallData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LooseCurtainWallData As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LooseCurtainWallData {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LooseDimensionFailures Class
Autodesk.Revit.DB Namespace